In [3]:
import pandas as pd
import numpy as np
df=pd.read_excel("sample_data1.xlsx")
df

   Serial Number               Title   Salary Qualification  Exp
0              1   Software Engineer  20000.0     Bachelors    3
1              2      Data Scientist  23000.0       Masters    4
2              3     Project Manager  18000.0       Masters    2
3              4           Professor  25000.0     Bachelors    5
4              5  Database Architect  17000.0     Bachelors    1
5              4           Professor  25000.0     Bachelors    5
6              7    Business Analyst  18000.0           NaN    5
7              8     UX/UI Developer     23.0     Bachelors    0
8              9     Devops Engineer      NaN       Masters    2

In [ ]:
# Task 1
print(df.isnull().sum())

Serial Number    0
Title            0
Salary           1
Qualification    1
Exp              0
dtype: int64

In [ ]:
#Rows with Missing Salary
print(df[df['Salary'].isnull()])

   Serial Number            Title  Salary Qualification  Exp
8              9  Devops Engineer     NaN       Masters    2

In [5]:
# View Rows with Missing Qualification
print(df[df['Qualification'].isnull()])

   Serial Number             Title   Salary Qualification  Exp
6              7  Business Analyst  18000.0           NaN    5

In [7]:
df_cleaned = df.dropna()
print(df_cleaned.isnull().sum())

Serial Number    0
Title            0
Salary           0
Qualification    0
Exp              0
dtype: int64

In [9]:
# TASK 2
print("Null values before imputation:")
print(df.isnull().sum())

Null values before imputation:
Serial Number    0
Title            0
Salary           0
Qualification    0
Exp              0
dtype: int64

In [10]:
mean_salary = df['Salary'].mean()

In [11]:
mode_qualification = df['Qualification'].mode()[0]

In [ ]:
df['Salary'] = df['Salary'].fillna(mean_salary)
df['Qualification'] = df['Qualification'].fillna(mode_qualification)

In [16]:
print("Null values after imputation:")
print(df.isnull().sum())
print(df.head())

Null values after imputation:
Serial Number    0
Title            0
Salary           0
Qualification    0
Exp              0
dtype: int64
   Serial Number               Title   Salary Qualification  Exp
0              1   Software Engineer  20000.0     Bachelors    3
1              2      Data Scientist  23000.0       Masters    4
2              3     Project Manager  18000.0       Masters    2
3              4           Professor  25000.0     Bachelors    5
4              5  Database Architect  17000.0     Bachelors    1

In [17]:
# TASK 3
print("Duplicate row status:")
print(df.duplicated())

Duplicate row status:
0    False
1    False
2    False
3    False
4    False
5     True
6    False
7    False
8    False
dtype: bool

In [18]:
print("Duplicate rows:")
print(df[df.duplicated()])

Duplicate rows:
   Serial Number      Title   Salary Qualification  Exp
5              4  Professor  25000.0     Bachelors    5

In [19]:
df_no_duplicates = df.drop_duplicates().reset_index(drop=True)

In [20]:
print("Data after removing duplicates:")
print(df_no_duplicates)

Data after removing duplicates:
   Serial Number               Title     Salary Qualification  Exp
0              1   Software Engineer  20000.000     Bachelors    3
1              2      Data Scientist  23000.000       Masters    4
2              3     Project Manager  18000.000       Masters    2
3              4           Professor  25000.000     Bachelors    5
4              5  Database Architect  17000.000     Bachelors    1
5              7    Business Analyst  18000.000     Bachelors    5
6              8     UX/UI Developer     23.000     Bachelors    0
7              9     Devops Engineer  18252.875       Masters    2